## Pandas GroupBy

In [37]:
import numpy as np
import pandas as pd

In [38]:
#you are hr data analyst for techCrop . you have been provided with a dataframe as df 
# name employ name
#department 
# role 
# experimence
#salary 
#score
data = {
    "Name": ["Aman","Sagar","Sehab","Samrat"],
    "Department": ["IT","HR","Finance","Marketing"],
    "Role": ["Developer","Manager","Analyst","Specialist"],
    "Experimence": [10,5,8,12],
    "Salary": [50000,60000,55000,70000],
    "Score": [85,92,78,95]
}
df = pd.DataFrame(data)
df

     Name Department        Role  Experimence  Salary  Score
0    Aman         IT   Developer           10   50000     85
1   Sagar         HR     Manager            5   60000     92
2   Sehab    Finance     Analyst            8   55000     78
3  Samrat  Marketing  Specialist           12   70000     95

In [39]:
#basic average 
#mean salary for each department
df.groupby("Department")["Salary"].mean()

Department
Finance      55000.0
HR           60000.0
IT           50000.0
Marketing    70000.0
Name: Salary, dtype: float64

In [40]:
# mean performance score for each role
df.groupby("Role")["Score"].mean()

Role
Analyst       78.0
Developer     85.0
Manager       92.0
Specialist    95.0
Name: Score, dtype: float64

In [41]:
#counting and sizing 
# how many actual non null performenace score entries exit for each deparment
df.groupby("Department")["Score"].count()

Department
Finance      1
HR           1
IT           1
Marketing    1
Name: Score, dtype: int64

In [42]:
# what is the total number of employee record(row) in each department, regardless of whether data is missing
df.groupby("Department").size()

Department
Finance      1
HR           1
IT           1
Marketing    1
dtype: int64

In [43]:
#multiple aggregate
#geenrate table foe salary based on department thta show mean , maximu, minumu and count in asingle line of code
df.groupby("Department")["Salary"].agg(["mean", "max", "min", "count"])

               mean    max    min  count
Department
Finance     55000.0  55000  55000      1
HR          60000.0  60000  60000      1
IT          50000.0  50000  50000      1
Marketing   70000.0  70000  70000      1

In [44]:
# generate the same summummry table (mean,max,min,count) but analyze the performance Score based on the role
df.groupby("Role")["Score"].agg(["mean", "max", "min", "count"])

            mean  max  min  count
Role
Analyst     78.0   78   78      1
Developer   85.0   85   85      1
Manager     92.0   92   92      1
Specialist  95.0   95   95      1

In [45]:
#grouping by multiple columns
#find the average salary grouped by both department and role.
df.groupby(["Department","Role"])["Salary"].mean()

Department  Role
Finance     Analyst       55000.0
HR          Manager       60000.0
IT          Developer     50000.0
Marketing   Specialist    70000.0
Name: Salary, dtype: float64

In [46]:
#find average performance score grouped by both department and experience
df.groupby(["Department","Experimence"])["Score"].mean()

Department  Experimence
Finance     8              78.0
HR          5              92.0
IT          10             85.0
Marketing   12             95.0
Name: Score, dtype: float64